Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItemEnumerator Properties
The MaterialMarketSizesItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a MaterialMarketSizesItem instance with the current index.
Top
See Also
Reference
MaterialMarketSizesItemEnumerator Class
Tekla.Structures.Catalogs Namespace